---@diagnostic disable: undefined-global, lowercase-global

arg                 =
'Аргументи командного рядка `Lua Standalone`.'

assert              =
[[
Викликає помилку, якщо `v` є хибним (`nil` або `false`); якщо помилки немає — повертає всі передані аргументи.

У разі помилки її об'єктом є `message`, а якщо `message` відсутній — використовується рядок `"assertion failed!"`.
]]

collectgarbage51    =
[[
Функція є загальним інтерфейсом до збирача сміття. Вона виконує різні дії залежно від першого аргументу — `opt`:

* `"collect"`: Виконує повний цикл збирання сміття. Це опція за замовчуванням.
* `"stop"`: Зупиняє збирач сміття.
* `"restart"`: Перезапускає збирач сміття.
* `"count"`: Повертає загальний обсяг пам'яті, що використовується `Lua` (у кілобайтах).
* `"step"`: Виконує крок збирання сміття. "Розмір" кроку контролюється за допомогою `arg` у невказаний спосіб (більші значення означають більше кроків). Якщо ви хочете контролювати розмір кроку, ви повинні експериментально налаштувати значення `arg`. Повертає `true`, якщо крок завершив цикл збирання сміття.
* `"setpause"`: Встановлює `arg` як нове значення паузи збирача (див. §2.10). Повертає попереднє значення паузи.
* `"setstepmul"`: Встановлює `arg` як нове значення множника кроку збирача (див. §2.10). Повертає попереднє значення кроку.
]]

collectgarbage52    =
[[
Функція є загальним інтерфейсом до збирача сміття. Вона виконує різні дії залежно від першого аргументу — `opt`:

* `"collect"`: Виконує повний цикл збирання сміття. Це опція за замовчуванням.
* `"stop"`: Зупиняє збирач сміття.
* `"restart"`: Перезапускає збирач сміття.
* `"count"`: Повертає загальний обсяг пам'яті, що використовується `Lua` (у кілобайтах), а також повний обсяг пам'яті у байтах за модулем 1024. Перше значення має дробову частину, тому наведена рівність завжди істинна:
    ```lua
     k, b = collectgarbage("count")
     assert(k*1024 == math.floor(k)*1024 + b)
     ```
    (Другий результат корисний у випадку, якщо код скомпільовано з типом чисел, відмінним від типу з рухомою комою.)
* `"step"`: Виконує крок збирання сміття. "Розмір" кроку контролюється за допомогою `arg` у невказаний спосіб (більші значення означають більше кроків). Якщо ви хочете контролювати розмір кроку, ви повинні експериментально налаштувати значення `arg`. Повертає `true`, якщо крок завершив цикл збирання сміття.
* `"setpause"`: Встановлює `arg` як нове значення паузи збирача (див. §2.5). Повертає попереднє значення паузи.
* `"setstepmul"`: Встановлює `arg` як нове значення множника кроку збирача (див. §2.5). Повертає попереднє значення кроку.
* `"isrunning"`: Повертає `boolean`, що свідчить про те, чи запущений збирач.
* `"generational"`: Змінює режим збирача на генераційний. Це експериментальна функція (див. §2.5).
* `"incremental"`: Змінює режим збирача на інкрементальний. Це режим за замовчуванням.
]]

collectgarbage53    =
[[
Функція є загальним інтерфейсом до збирача сміття. Вона виконує різні дії залежно від першого аргументу — `opt`:

* `"collect"`: Виконує повний цикл збирання сміття. Це опція за замовчуванням.
* `"stop"`: Зупиняє збирач сміття.
* `"restart"`: Перезапускає збирач сміття.
* `"count"`: Повертає загальний обсяг пам'яті, що використовується `Lua`, у кілобайтах. Значення має дробову частину; при множенні на 1024 воно повертає точну кількість байтів, що використовує `Lua` (за винятком переповнень).
* `"step"`: Виконує крок збирання сміття. "Розмір" кроку контролюється за допомогою `arg`. У разі нульового значення збирач виконає один базовий (неподільний) крок. Для ненульових значень збирач працюватиме так, ніби цей обсяг пам'яті (у кілобайтах) був виділений `Lua`. Повертає `true`, якщо крок завершив цикл збирання сміття.
* `"setpause"`: Встановлює `arg` як нове значення паузи збирача (див. §2.5). Повертає попереднє значення паузи.
* `"setstepmul"`: Встановлює `arg` як нове значення множника кроку збирача (див. §2.5). Повертає попереднє значення кроку.
* `"isrunning"`: Повертає `boolean`, що свідчить про те, чи запущений збирач.
]]

collectgarbage54    =
[[
Функція є загальним інтерфейсом до збирача сміття. Вона виконує різні дії залежно від першого аргументу — `opt`:

* `"collect"`: Виконує повний цикл збирання сміття. Це опція за замовчуванням.
* `"stop"`: Зупиняє збирач сміття.
* `"restart"`: Перезапускає збирач сміття.
* `"count"`: Повертає загальний обсяг пам'яті, що використовується `Lua`, у кілобайтах. Значення має дробову частину; при множенні на 1024 воно дає точну кількість байтів, що використовує `Lua`.
* `"step"`: Виконує крок збирання сміття. "Розмір" кроку контролюється за допомогою `arg`. У разі нульового значення збирач виконає один базовий (неподільний) крок. Для ненульових значень збирач працюватиме так, ніби цей обсяг пам'яті (у кілобайтах) був виділений `Lua`. Повертає `true`, якщо крок завершив цикл збирання сміття.
* `"isrunning"`: Повертає `boolean`, що свідчить про те, чи запущений збирач.
* `"incremental"`: Змінює режим збирача на інкрементальний. Після цього можуть йти три числа: пауза збирача сміття, множник кроку, а також розмір кроку (див. §2.5.1). Нуль означає, що значення не змінюється.
* `"generational"`: Змінює режим збирача на генераційний. Після цього можуть йти два числа: мінорний і мажорний множники збирача сміття (див. §2.5.2). Нуль означає, що значення не змінюється.
Для отримання додаткової інформації про збирач сміття та опції для нього дивіться §2.5.

Функція не повинна викликатися фіналізатором.
]]

collectgarbage55    =
[[
Функція є загальним інтерфейсом до збирача сміття. Вона виконує різні дії залежно від першого аргументу — `opt`:

* `"collect"`: Виконує повний цикл збирання сміття. Це опція за замовчуванням.
* `"stop"`: Зупиняє збирач сміття.
* `"restart"`: Перезапускає збирач сміття.
* `"count"`: Повертає загальний обсяг пам'яті, що використовується `Lua`, у кілобайтах. Значення має дробову частину; після множення на 1024 воно повертає точну кількість байтів.
* `"step"`: Виконує крок збирання сміття. Приймає ціле число, що визначає розмір кроку.

    Якщо розмір — це додатне число `n`, то збирач поводиться так, ніби було виділено `n` байтів. 
    
    Якщо розмір нульовий, збирач виконує базовий крок. 
    
    В інкрементальному режимі базовий крок відповідає розміру поточного кроку. 
    
    У генераційному режимі базовий крок виконує повне мінорне збирання сміття або, якщо збирач запланував, виконує інкрементальний крок.

    В інкрементальному режимі функція повертає `true`, якщо крок завершив цикл збирання сміття. 
    
    У генераційному режимі функція повертає `true`, якщо крок завершив мажорний цикл збирання сміття.

* `"isrunning"`: Повертає `boolean`, що свідчить про те, чи запущений збирач.
* `"incremental"`: Змінює режим збирача на інкрементальний та повертає значення попереднього режиму.
* `"generational"`: Змінює режим збирача на генераційний та повертає значення попереднього режиму.
* `"param"`: Змінює та/або отримує значення параметра збирача. Повинна мати додаткові аргументи: назву параметра (рядок) та опціональне значення для нього — ціле число у діапазоні [0, 100000]. Перший аргумент повинен мати одне з наведених нижче значень:
    * `"minormul"`: Мінорний множник.
    * `"majorminor"`: Мажорно-мінорний множник.
    * `"minormajor"`: Мінорно-мажорний множник.
    * `"pause"`: Пауза збирача сміття.
    * `"stepmul"`: Множник кроку.
    * `"stepsize"`: Розмір кроку.

    Виклик завжди повертає попереднє значення параметра. Якщо під час виклику не передано нового значення, параметр залишається без змін.

    `Lua` зберігає ці значення у стисненому форматі, тому попереднє повернуте значення може НЕ дорівнювати останньому встановленому.

Для отримання додаткової інформації про збирач сміття та опції для нього дивіться §2.5.

Функція не повинна викликатися фіналізатором.
]]

dofile              =
[[
Відкриває файл за назвою та виконує його вміст як чанк.

У разі виклику без аргументів `dofile` виконує вміст стандартного введення (`stdin`). 

Повертає усе те, що повернув чанк. 

У разі помилки `dofile` передає її тому, хто викликає функцію. 

`dofile` ніколи не виконується у захищеному режимі.
]]

error               =
[[
Зупиняє останню захищену функцію, повертає повідомлення як об'єкт помилки. 

Зазвичай `error` додає певну інформацію про помилку на початку повідомлення.
]]

_G                  =
'Глобальна змінна, що містить глобальне середовище (див. §2.2). Зміна цього значення не впливає на жодне середовище, і навпаки.'

getfenv             =
'Повертає середовище, що використовується функцією. `f` може бути функцією або числом, що визначає функцію на рівні стека.'

getmetatable        =
[[
Якщо об'єкт не має метатаблиці — повертає `nil`.

В іншому випадку, якщо метатаблиця об'єкта має поле `__metatable` — повертає пов'язане значення. 

Інакше повертає метатаблицю наданого об'єкта.
]]

ipairs              =
[[
Повертає три значення (функцію-ітератор, таблицю `t`, `0`).

Наведена конструкція:

```lua
    for i,v in ipairs(t) do body end
```

ітерує кожну пару ключ–значення до кінця `t`.
]]

loadmode.b          =
'Бінарні чанки.'
loadmode.t          =
'Текстові чанки.'
loadmode.bt         =
'Бінарні й текстові чанки.'

load['<5.1']        =
[[
Завантажує чанк, використовуючи `func`, щоб отримати його частини.

Кожен виклик `func` повинен повертати рядок, який об'єднується з результатами попередніх викликів.
]]

load['>5.2']        =
[[
Завантажує чанк.

Якщо `chunk` — рядок, то чанк і є цим рядком. 

Якщо `chunk` — функція, то `load` неодноразово викликає її для отримання частин чанку. 

Кожен виклик `chunk` повинен повертати рядок, який об'єднується з результатами попередніх викликів. 

Повернення порожнього рядка, `nil` або повна відсутність значення означає кінець чанку.
]]

loadfile            =
'Завантажує чанк із `filename` або із стандартного введення, якщо назва файлу не задана.'

loadstring          =
'Завантажує чанк з рядка.'

module              =
'Створює модуль.'

next                =
[[
Дозволяє пройтися по всіх полях таблиці. 

Першим аргументом є таблиця, другим — індекс у таблиці. 

Виклик `next` повертає наступний індекс та пов'язане з ним значення. 

У разі виклику з `nil` у ролі другого аргументу `next` повертає початковий індекс та пов'язане з ним значення. 

У разі виклику з останнім індексом або з `nil` у порожній таблиці `next` повертає `nil`. 

Якщо другий аргумент відсутній, це інтерпретується як `nil`. 

Зокрема, ви можете використовувати `next(t)` для перевірки таблиці на порожність.

Порядок перебору індексів не визначений, *навіть для числових індексів*.

Для обходу таблиці в числовому порядку використовуйте цикл `for`.

Поведінка `next` невизначена, якщо протягом обходу ви присвоїли значення неіснуючому полю, однак ви можете змінювати існуючі поля. 

Зокрема, ви можете встановити значення існуючих полів як `nil`.
]]

pairs               =
[[
Якщо `t` має метаметод `__pairs`, то функція викликає його з `t` у якості аргумента і повертає перші три результати виклику.

Інакше повертає три значення: функцію `$next`, таблицю `t`, `nil`.

Наведена конструкція:

```lua
    for k,v in pairs(t) do body end
```

ітерує кожну пару ключ-значення `t`.
]]

pcall               =
[[
Викликає `f` із наданими аргументами у *захищеному режимі*. 

Це означає, що будь-яка помилка в `f` НЕ повертається тому, хто викликає функцію. 

Натомість `pcall` ловить помилку та повертає статус. 

Перший результат — це статус, що дорівнює `true`, якщо виклик пройшов без помилок. 

У такому разі `pcall` також повертає всі результати виклику, починаючи з другого. 

У разі помилки `pcall` повертає `false` та сам об'єкт помилки.
]]

print               =
[[
Приймає будь-яку кількість аргументів та виводить їх в `stdout`. 

Конвертація кожного аргумента в рядок відбувається так само, як і в `$tostring`. 

Функція не призначена для форматованого виведення; це лише простий спосіб відображення значень, наприклад для налагодження. 

Для повного контролю вихідних даних використовуйте `$string.format` та `$io.write`.
]]

rawequal            =
'Перевіряє, чи `v1` дорівнює `v2`, без виклику метаметоду `__eq`.'

rawget              =
'Отримує значення `table[index]`, без виклику метаметоду `__index`.'

rawlen              =
'Повертає розмір об\'єкта `v`, без виклику метаметоду `__len`.'

rawset              =
[[
Встановлює значення `table[index]` у `value`, без використання метаметоду `__newindex`. 

`table` повинна бути таблицею, `index` — будь-яким значенням, крім `nil` та `NaN`, `value` — будь-яким значенням. 

Функція повертає `table`.
]]

select              =
[[
Якщо `index` є числом, функція повертає всі аргументи, починаючи з того, чий порядковий номер дорівнює `index`. 

Від'ємний індекс відлічується з кінця (де `-1` — останній аргумент). 

Якщо `index` є рядком `"#"`, повертає кількість аргументів.
]]

setfenv             =
'Встановлює середовище, яке використовуватиметься наданою функцією.'

setmetatable        =
[[
Встановлює метатаблицю.

Якщо `metatable` — це `nil`, видаляє метатаблицю у наданій таблиці.

Якщо метатаблиця має поле `__metatable`, викликає помилку.

Функція повертає `table`.

Для зміни метатаблиці інших типів ви повинні використовувати бібліотеку налагодження (див. §6.10).
]]

tonumber            =
[[
У разі відсутності `base`, `tonumber` намагається конвертувати аргумент у число.

Якщо аргумент вже є числом або рядком, який можливо конвертувати в число, `tonumber` повертає це число; в іншому разі повертає `nil`.

Результатом можуть бути цілі числа або числа з рухомою комою (див. §3.1).
]]

tostring            =
[[
Отримує значення будь-якого типу і конвертує його у рядок.

Якщо `v` має поле `__tostring`, тоді `tostring` викликає відповідне значення з `v` у якості аргументу і повертає результат виклику.

В іншому випадку, якщо `v` має поле `__name` з рядком у якості значення, `tostring` може повернути цей рядок.

Для повного контролю того, як конвертуються числа, використовуйте `$string.format`.
]]

type                =
[[
Повертає тип у вигляді рядка. 

Можливі результати: `"nil"`, `"number"`, `"string"`, `"boolean"`, `"table"`, `"function"`, `"thread"`, `"userdata"`.
]]

_VERSION            =
'Глобальна змінна, що є рядком з версією `Lua`.'

warn                =
'Видає попередження з повідомленням, створеним шляхом об\'єднання всіх аргументів.'

xpcall['=5.1']      =
'Викликає функцію `f` у захищеному режимі з наданими аргументами, користуючись новим обробником повідомлень.'
xpcall['>5.2']      =
'Викликає функцію `f` у захищеному режимі з наданими аргументами, користуючись новим обробником повідомлень.'

unpack              =
[[
Повертає елементи списку, еквівалентно:

```lua
    return list[i], list[i+1], ···, list[j]
```
]]

bit32               =
''
bit32.arshift       =
'Повертає число `x`, зсунуте на `disp` бітів праворуч.'
bit32.band          =
'Повертає побітове *AND*.'
bit32.bnot          =
[[
Повертає побітове *NOT*.

```lua
assert(bit32.bnot(x) ==
(-1 - x) % 2^32)
```
]]
bit32.bor           =
'Повертає побітове *OR*.'
bit32.btest         =
'Чи не дорівнює нулю побітове *AND*?'
bit32.bxor          =
'Повертає побітове *XOR*.'
bit32.extract       =
'Повертає беззнакове число, утворене з бітів `n` від `field` до `field + width - 1`.'
bit32.replace       =
'Повертає копію `n`, у якій біти від `field` до `field + width - 1` замінено значенням `v`.'
bit32.lrotate       =
'Повертає число `x`, обернене на `disp` бітів ліворуч.'
bit32.lshift        =
'Повертає число `x`, зсунуте на `disp` бітів ліворуч.'
bit32.rrotate       =
'Повертає число `x`, обернене на `disp` бітів праворуч.'
bit32.rshift        =
[[
Повертає число `x`, зсунуте на `disp` бітів праворуч.

```lua
assert(bit32.rshift(b, disp) ==
math.floor(b % 2^32 / 2^disp))
```
]]

coroutine                   =
''
coroutine.create            =
'Створює нову корутину з тілом `f` і повертає об\'єкт з типом `"thread"`.'
coroutine.isyieldable       =
'Повертає `true`, якщо корутина може зупинитись.'
coroutine.isyieldable['>5.4']=
'Повертає `true`, якщо `co` може зупинитись. Зазвичай для `co` використовується запущена корутина.'
coroutine.close             =
'Закриває і переносить у мертвий стан корутину `co`.'
coroutine.resume            =
'Запускає/відновлює `co`.'
coroutine.running           =
'Повертає запущену корутину та `true`, якщо вона є головною.'
coroutine.status            =
'Повертає статус корутини `co`.'
coroutine.wrap              =
'Створює нову корутину з тілом `f`. Повертає функцію, що відновлює виконання корутини при виклику.'
coroutine.yield             =
'Зупиняє виконання корутини.'

costatus.running            =
'Запущена?'
costatus.suspended          =
'Зупинена?'
costatus.normal             =
'Активна і незапущена?'
costatus.dead               =
'Завершилась з помилкою?'

debug                       =
''
debug.debug                 =
'Входить в інтерактивний режим, де обробляє кожен введений вами рядок.'
debug.getfenv               =
'Повертає середовище `o`.'
debug.gethook               =
'Повертає налаштування хука.'
debug.getinfo               =
'Повертає таблицю з інформацією про функцію.'
debug.getlocal['<5.1']      =
'Повертає назву та значення локальної змінної з індексом `local` у функції на рівні `level` стека.'
debug.getlocal['>5.2']      =
'Повертає назву та значення локальної змінної з індексом `local` у функції на рівні `f` стека.'
debug.getmetatable          =
'Повертає метатаблицю.'
debug.getregistry           =
'Повертає таблицю реєстру.'
debug.getupvalue            =
'Повертає назву та `upvalue` функції з індексом `up`.'
debug.getuservalue['<5.3']  =
'Повертає пов\'язане з `u` значення.'
debug.getuservalue['>5.4']  =
'Повертає `n`-не значення користувача, пов\'язане з `u`, плюс `boolean`. `false`, якщо `userdata` не має значення.'
debug.setcstacklimit        =
[[
### **Функція застаріла з версії `5.4.2`**

Встановлює новий ліміт для стека `C`. 

Цей ліміт контролює, наскільки глибоко вкладені виклики можуть піти для уникнення переповнення стека в `Lua`.

У разі успіху повертає старий ліміт. 

У випадку помилки повертає `false`.
]]
debug.setfenv               =
'Встановлює середовище для `table`.'
debug.sethook               =
'Робить функцію хуком.'
debug.setlocal              =
'Присвоює `value` локальній змінній з індексом `local` на рівні `level` стека.'
debug.setmetatable          =
'Встановлює метатаблицю наданому значенню.'
debug.setupvalue            =
'Присвоює `value` до `upvalue` з індексом `up`.'
debug.setuservalue['<5.3']  =
'Встановлює надане значення як пов\'язане з `udata`.'
debug.setuservalue['>5.4']  =
'Встановлює надане `value` як `n`-не значення, пов\'язане з `udata`. `udata` повинна бути повною `userdata`.'
debug.traceback             =
'Повертає рядок з трасуванням стека. Повідомлення приєднується на початок трасування.'
debug.upvalueid             =
'Повертає унікальний ідентифікатор для пронумерованого значення `n` наданої функції.'
debug.upvaluejoin           =
'Робить так, щоб перший `upvalue` замикання `f1` посилався на другий `upvalue` замикання `f2`.'

infowhat.n                  =
'`name` та `namewhat`'
infowhat.S                  =
'`source`, `short_src`, `linedefined`, `lastlinedefined`, та `what`'
infowhat.l                  =
'`currentline`'
infowhat.t                  =
'`istailcall`'
infowhat.u['<5.1']          =
'`nups`'
infowhat.u['>5.2']          =
'`nups`, `nparams`, `isvararg`'
infowhat.f                  =
'`func`'
infowhat.r                  =
'`ftransfer` та `ntransfer`'
infowhat.L                  =
'`activelines`'

hookmask.c                  =
'Викликає хук, коли відбувається виклик функції.'
hookmask.r                  =
'Викликає хук, коли відбувається повернення з функції.'
hookmask.l                  =
'Викликає хук, коли `Lua` заходить на новий рядок коду.'

file                        =
''
file[':close']              =
'Закриває `file`.'
file[':flush']              =
'Зберігає будь-які записані дані у `file`.'
file[':lines']              =
[[
------
```lua
for c in file:lines(...) do
    body
end
```
]]
file[':read']               =
'Читає `file` відповідно до наданих форматів.'
file[':seek']               =
'Визначає і отримує позицію в файлі.'
file[':setvbuf']            =
'Встановлює режим буферизації для вихідного файлу.'
file[':write']              =
'Записує значення кожного з аргументів у `file`.'

readmode.n                  =
'Повертає прочитане буквально як число.'
readmode.a                  =
'Повністю читає файл.'
readmode.l                  =
'Читає наступний рядок, вирізає `\\n`.'
readmode.L                  =
'Читає наступний рядок, залишає `\\n`.'

seekwhence.set              =
'Початок файлу.'
seekwhence.cur              =
'Поточна позиція.'
seekwhence['.end']          =
'Кінець файлу.'

vbuf.no                     =
'Записується миттєво.'
vbuf.full                   =
'Записується лише тоді, коли буфер заповнений.'
vbuf.line                   =
'Буферизується до записування нового рядка.'

io                          =
''
io.stdin                    =
'Стандартне введення.'
io.stdout                   =
'Стандартне виведення.'
io.stderr                   =
'Стандартне виведення помилки.'
io.close                    =
'Закриває `file` або файл стандартного виведення.'
io.flush                    =
'Зберігає будь-які записані дані в файл виведення.'
io.input                    =
'Встановлює `file` файлом введення.'
io.lines                    =
[[
------
```lua
for c in io.lines(filename, ...) do
    body
end
```
]]
io.open                     =
'Відкриває файл у режимі `mode`.'
io.output                   =
'Встановлює `file` файлом виведення.'
io.popen                    =
'Запускає `prog` у розділених процесах.'
io.read                     =
'Читає `file` згідно з наданими форматами.'
io.tmpfile                  =
'Повертає дескриптор тимчасового файлу.'
io.type                     =
'Перевіряє, чи є `obj` дійсним дескриптором файлу.'
io.write                    =
'Записує значення кожного з аргументів у файл виведення.'

openmode.r                  =
'Режим читання.'
openmode.w                  =
'Режим запису.'
openmode.a                  =
'Режим додавання.'
openmode['.r+']             =
'Режим оновлення, всі попередні дані збережені.'
openmode['.w+']             =
'Режим оновлення, всі попередні дані стерті.'
openmode['.a+']             =
'Режим оновлення і додавання, попередні дані збережені, запис дозволений тільки починаючи з кінця файлу.'
openmode.rb                 =
'Бінарний режим читання.'
openmode.wb                 =
'Бінарний режим запису.'
openmode.ab                 =
'Бінарний режим додавання.'
openmode['.r+b']            =
'Бінарний режим оновлення, всі попередні дані збережені.'
openmode['.w+b']            =
'Бінарний режим оновлення, всі попередні дані стерті.'
openmode['.a+b']            =
'Бінарний режим оновлення і додавання, попередні дані збережені, запис дозволений тільки починаючи з кінця файлу.'

popenmode.r                 =
'Читає всі дані з `file`.'
popenmode.w                 =
'Записує всі дані з `file`.'

filetype.file               =
'Дескриптор відкритий?'
filetype['.closed file']    =
'Дескриптор закритий?'
filetype['.nil']            =
'Це дескриптор?'

math                        =
''
math.abs                    =
'Повертає модуль `x`.'
math.acos                   =
'Повертає арккосинус `x`.'
math.asin                   =
'Повертає арксинус `x`.'
math.atan['<5.2']           =
'Повертає арктангенс `x`.'
math.atan['>5.3']           =
'Повертає арктангенс відношення `y` до `x`.'
math.atan2                  =
'Повертає арктангенс відношення `y` до `x`.'
math.ceil                   =
'Повертає найменше ціле число, що більше або дорівнює `x`.'
math.cos                    =
'Повертає косинус `x`.'
math.cosh                   =
'Повертає гіперболічний косинус `x`.'
math.deg                    =
'Конвертує кут `x` із радіанів у градуси.'
math.exp                    =
'Повертає `e^x` (`e` — основа натуральних логарифмів).'
math.floor                  =
'Повертає найбільше ціле число, що не перевищує `x`.'
math.fmod                   =
'Повертає остачу від ділення `x` на `y`, округлюючи частку до нуля.'
math.frexp                  =
[[
Повертає два числа: `m` та `e` як `x = m * (2 ^ e)`, де `e` є цілим числом.

Якщо `x` є нулем, `NaN`, `+inf`, `-inf`, `m` дорівнюватиме `x`; в іншому випадку значення модуля `m` лежить у діапазоні [0.5, 1).
]]
math.huge                   =
'Найбільше число.'
math.ldexp                  =
'Повертає `m * (2 ^ e)`, де `e` є цілим числом.'
math.log['<5.1']            =
'Повертає натуральний логарифм `x`.'
math.log['>5.2']            =
'Повертає логарифм `x` у заданій основі.'
math.log10                  =
'Повертає десятковий логарифм `x`.'
math.max                    =
'Повертає аргумент з найбільшим значенням.'
math.maxinteger['>5.3']     =
'Найбільше ціле число.'
math.min                    =
'Повертає аргумент з найменшим значенням.'
math.mininteger['>5.3']     =
'Найменше ціле число.'
math.modf                   =
'Повертає цілу та дробову частини `x`.'
math.pi                     =
'*π*.'
math.pow                    =
'Повертає `x ^ y`.'
math.rad                    =
'Конвертує кут `x` із градусів у радіани.'
math.random                 =
[[
* `math.random()`: Повертає число з рухомою комою у діапазоні [0, 1).

* `math.random(n)`: Повертає ціле число у діапазоні [1, n].

* `math.random(m, n)`: Повертає ціле число у діапазоні [m, n].
]]
math.randomseed['<5.3']     =
'Встановлює `x` як `seed` для генератора псевдо-випадкових чисел.'
math.randomseed['>5.4']     =
[[
* `math.randomseed(x, y)`: Поєднує `x` та `y` у 128-бітний `seed` для реініціалізації генератора псевдо-випадкових чисел.

* `math.randomseed(x)`: Те саме, що і `math.randomseed(x, 0)`.

* `math.randomseed()`: Генерує `seed`, але має слабку випадковість.
]]
math.sin                    =
'Повертає синус `x`.'
math.sinh                   =
'Повертає гіперболічний синус `x`.'
math.sqrt                   =
'Повертає квадратний корінь `x`.'
math.tan                    =
'Повертає тангенс `x`.'
math.tanh                   =
'Повертає гіперболічний тангенс `x`.'
math.tointeger['>5.3']      =
'Повертає `x`, якщо його можливо конвертувати в ціле число.'
math.type['>5.3']           =
'Повертає тип числа або повертає `nil`, якщо `x` не є числом.'
math.ult['>5.3']            =
'Повертає `true`, якщо `m` менше за `n`. Порівнюються як беззнакові цілі числа.'

os                          =
''
os.clock                    =
'Повертає приблизну кількість використаного часу процесора у секундах.'
os.date                     =
'Повертає відформатований рядок або таблицю з датою і часом.'
os.difftime                 =
'Повертає різницю у секундах між `t1` і `t2`.'
os.execute                  =
'Виконує `command` у командній оболонці операційної системи.'
os.exit['<5.1']             =
'Завершує програму за допомогою `exit` з `C`.'
os.exit['>5.2']             =
'Завершує програму за допомогою `exit` з `ISO C`.'
os.getenv                   =
'Повертає значення середовища, що відповідає `varname`.'
os.remove                   =
'Видаляє файл.'
os.rename                   =
'Змінює назву файлу або директорії.'
os.setlocale                =
'Встановлює поточну локаль програми.'
os.time                     =
'Якщо викликати без аргументів — повертає поточний час, якщо надати таблицю — повертає зазначені дату й час.'
os.tmpname                  =
'Назва для тимчасового файлу.'

osdate.year                 =
'Рік'
osdate.month                =
'Місяць'
osdate.day                  =
'День'
osdate.hour                 =
'Година'
osdate.min                  =
'Хвилина'
osdate.sec                  =
'Секунда'
osdate.wday                 =
'День тижня'
osdate.yday                 =
'День року'
osdate.isdst                =
'Перехід на літній час'

package                     =
''

require['<5.3']             =
'Завантажує заданий модуль і повертає те, що він повернув (`true` у разі `nil`).'
require['>5.4']             =
[[
Завантажує заданий модуль і повертає те, що повернув шукач (`true` у разі `nil`).

Також повертає дані завантажувача, що вказують на те, як `require` знайшов модуль.

Наприклад, якщо модуль завантажений з файлу, то даними є шлях до файлу.
]]

package.config              =
'Рядок з інформацією про `compile-time` конфігурації пакетів.'
package.cpath               =
'Шлях для пошуку `C-завантажувача`.'
package.loaded              =
'Таблиця для контролю завантажених модулів.'
package.loaders             =
'Таблиця для контролю того, як завантажувати модулі.'
package.loadlib             =
'Динамічно пов\'язує програму з C-бібліотекою.'
package.path                =
'Шлях для пошуку `Lua-завантажувача`.'
package.preload             =
'Таблиця для зберігання специфічних для завантажувача модулів.'
package.searchers           =
'Таблиця для контролю того, як завантажувати модулі.'
package.searchpath          =
'Шукає `name` у `path`.'
package.seeall              =
[[
Встановлює метатаблицю для `module` з полем `__index`, що вказує на глобальне середовище. 

Модуль успадковує значення з глобального середовища. 

Використовується як параметр функції `module`.
]]

string                      =
''
string.byte                 =
'Повертає числові коди символів.'
string.char                 =
'Повертає символи числових кодів.'
string.dump                 =
'Повертає рядок, що містить бінарне представлення наданої функції.'
string.find                 =
'Шукає перший збіг з `pattern` у рядку (див. §6.4.1).'
string.find['>5.2']         =
'Шукає перший збіг з `pattern` у рядку (див. §6.4.1).'
string.find['=5.1']         =
'Шукає перший збіг з `pattern` у рядку (див. §5.4.1).'
string.format               =
'Повертає відформатовану версію рядка.'
string.gmatch               =
[[
Повертає функцію-ітератор. 

Кожен виклик шукає збіг із `pattern` у `s` та повертає все, що вдалося захопити (див. §6.4.1).

Наприклад, цикл, який виводить кожне слово з нового рядка:

```lua
    s =
"hello world from Lua"
    for w in string.gmatch(s, "%a+") do
        print(w)
    end
```
]]
string.gsub                 =
'Повертає копію рядка, де всі збіги з `pattern` (або перші `n` збігів) замінені на `repl` (див. §6.4.1).'
string.gmatch['>5.2']       =
[[
Повертає функцію-ітератор, яка при кожному виклику повертає захоплені фрагменти, знайдені у `s` (див. §6.4.1).

Наприклад, цикл, який виводить кожне слово з нового рядка:

```lua
    s =
"hello world from Lua"
    for w in string.gmatch(s, "%a+") do
        print(w)
    end
```
]]
string.gmatch['=5.1']       =
[[
Повертає функцію-ітератор, яка при кожному виклику повертає захоплені фрагменти, знайдені у `s` (див. §5.4.1).

Наприклад, цикл, який виводить кожне слово з нового рядка:

```lua
    s =
"hello world from Lua"
    for w in string.gmatch(s, "%a+") do
        print(w)
    end
```
]]
string.gsub['>5.2']         =
'Повертає копію рядка, у якому збіги з `pattern` замінені на рядок `repl` (див. §6.4.1).'
string.gsub['=5.1']         =
'Повертає копію рядка, у якому збіги з `pattern` замінені на рядок `repl` (див. §5.4.1).'
string.len                  =
'Повертає довжину рядка.'
string.lower                =
'Повертає копію рядка з усіма символами у нижньому регістрі.'
string.match                =
'Шукає перший збіг з `pattern` у рядку і повертає захоплене, якщо був збіг. Інакше повертає `nil` (див. §6.4.1).'
string.pack                 =
'Повертає запакований згідно з `fmt` бінарний рядок, що є об\'єднанням `v1`, `v2` і т.д. (див. §6.4.2).'
string.packsize             =
'Повертає довжину рядка `string.pack`. Рядок формату не може містити варіанти змінної довжини `s` або `z` (див. §6.4.2).' 
string.match['>5.2']        =
'Шукає перший збіг з `pattern` у рядку (див. §6.4.1).'
string.match['=5.1']        =
'Шукає перший збіг з `pattern` у рядку (див. §5.4.1).'
string.pack['>5.2']         =
'Повертає запакований згідно з `fmt` бінарний рядок, що є об\'єднанням `v1`, `v2`, тощо (див. §6.4.2).'
string.packsize['>5.2']     =
'Повертає розмір результату `string.pack` з наданим `fmt` (див. §6.4.2).'
string.rep['>5.2']          =
'Повертає рядок, що є об\'єднанням `n` копій `s`, розділених `sep`.'
string.rep['<5.1']          =
'Повертає рядок, що є об\'єднанням `n` копій `s`.'
string.reverse              =
'Повертає рядок у зворотному порядку.'
string.sub                  =
'Повертає підрядок, що починається з `i` та продовжується до `j`.'
string.unpack               =
'Повертає значення, запаковані у рядок, згідно з `fmt` (див. §6.4.2).'
string.upper                =
'Повертає копію рядка з усіма символами у верхньому регістрі.'

table                       =
''
table.concat                =
'Повертає рядок `list[i]..sep..list[i+1] ··· sep..list[j]` для списку, що складається виключно з рядків або чисел.'
table.create                =
[[
Створює порожню таблицю, попередньо виділяючи пам'ять.

Це допомагає покращити продуктивність і зберігає пам'ять, коли ви точно знаєте, скільки елементів буде у майбутньому.

Параметр `nseq` є підказкою того, скільки елементів таблиця матиме як послідовності. 

Опціональний `nrec` є підказкою того, скільки інших елементів матиме таблиця; зазвичай є нулем.
]]
table.insert                =
'Вставляє елемент `value` в `list` на позицію `pos`.'
table.maxn                  =
'Повертає найбільший числовий індекс наданої таблиці, або нуль, якщо таблиця не має додатних числових індексів.'
table.move                  =
[[
Переміщує елементи з таблиці `a1` до таблиці `a2`.
```lua
a2[t],··· =
a1[f],···,a1[e]
return a2
```
]]
table.pack                  =
'Повертає таблицю, де всі аргументи стали ключами: `1`, `2` і т.д., і зберігає кількість аргументів у полі `"n"`.'
table.remove                =
'Видаляє елемент на позиції `pos` і повертає його значення.'
table.sort                  =
'Сортує елементи у заданій послідовності.'
table.unpack                =
[[
Повертає елементи наданого списку, еквівалентно:
```lua
    return list[i], list[i+1], ···, list[j]
```
Зазвичай, `i` це `1` і `j` це `#list`.
]]
table.foreach               =
[[
Виконує `f` для всіх елементів таблиці. 

Для кожного елемента, `f` викликається з індексом та відповідним значенням як аргументами. 

Якщо `f` повертає значення, що не є `nil`, тоді цикл переривається, і це значення повертається як останнє значення `foreach`.
]]
table.foreachi              =
[[
Виконує `f` для всіх числових індексів таблиці. 

Для кожного індекса, `f` викликається з індексом та відповідним значенням як аргументами. 

Індекси знаходяться у послідовному порядку, починаючи з 1 і до n, де n є розміром таблиці. 

Якщо `f` повертає значення, що не є `nil`, цикл переривається, а це значення повертається як останнє значення `foreachi`.
]]
table.getn                  =
'Повертає кількість елементів у таблиці.'
table.new                   =
[[
Створює таблицю з фіксованим розміром.

Це еквівалент виклику `lua_createtable()` з `C API`.

Функція дуже корисна на великих таблицях, якщо розмір у майбутньому відомий, а динамічне розширення занадто дороге. 

Параметр `narray` відповідає кількості масиво-подібних елементів, а параметр `nhash` відповідає кількості хеш-подібних елементів. 

Потребує `require` до використання.

```lua
    require("table.new")
```
]]
table.clear                 =
[[
Очищає таблицю, але залишає виділену пам'ять. 

Функція корисна, коли на таблицю посилаються з кількох місць. 

Звільняє від ручного керування `backlinks`, рятує від накладних витрат інкрементального росту таблиці. 

Потребує `require` до використання.

```lua
    require("table.clear")
```

Функція створена для специфічних випадків.

У більшості випадків краще просто замінити посилання новою таблицею та залишити всю роботу на збирач сміття.
]]

utf8                        =
''
utf8.char                   =
[[
Повертає символи `UTF-8` з числових кодів.

```lua
for p, c in utf8.codes(s) do
    body
end
```
]]
utf8.charpattern            =
'Паттерн, що збігається з послідовністю байтів `UTF-8` (за умови коректного `UTF-8`).'
utf8.codes                  =
'Ітератор обходу всіх символів `UTF-8` у рядку. Викликає помилку у разі недопустимої послідовності.'
utf8.codepoint              =
'Повертає числові коди всіх символів рядка `s`, що знаходяться між байтовими позиціями `i` та `j`.'
utf8.len                    =
'Повертає кількість символів `UTF-8` у рядку `s`, що знаходяться між байтовими позиціями `i` та `j`.'
utf8.offset                 =
'Повертає позицію, де починається `n`-ний символ рядка з позиції `i`.'
utf8.offset['55']             =
'Повертає позицію `n`-го символу рядка, починаючи з позиції `i`, у вигляді двох цілих чисел: індексу, де починається кодування, та індексу, де воно закінчується.'
